import streamlit as st

st.header("Reference Page")
with st.expander("التوازن األمامي "):
    text = '''
           يؤدى التوازن األمامي برفع الرجل الحرة عالًيا فـي المسـتوى األفقـي 90 درجـة أو
            أعلى مع ميل الجذع أما ًما في وضع موازى لألرض وفيه تدير الالعبة قدم االرتكاز
            بحيث يكون مركز ثقل الجسم فوق قدم االرتكـاز، كمـا يجـب االحتفـاظ
            للخارج قليالً
            بالجذع في وضع أفقي موازى لألرض مع استقامة الكتفين على خط واحد. '''
    st.markdown(f"<div dir='rtl'>{text}</div>", unsafe_allow_html=True)

    st.image("images/ref/front.png")

with st.expander("التوازن الجانبي"):
    text = '''
           يؤدى التوازن الجانبي برفع الحرة جانًبا في المستوى األفقي 90 درجة أو أعلـى مـع
            ميـل الجـذع جانبـاً واسـتقامة الجـذع فـي الوضـع الجـانبي، وفيـه تـدير الالعبـة قـدم
            120
            بحيث يكون مركز ثقل الجسم فـوق قـدم االرتكـاز، كمـا يجـب
            االرتكاز للخارج قليالً
            االحتفاظ بالجذع في وضع موازى لألرض وأستقام الكتفين على خط واحد.
       '''
    st.markdown(f"<div dir='rtl'>{text}</div>", unsafe_allow_html=True)

    st.image("images/ref/side.png")

